# 空格数和行号是相同的
#       空格 星  差值  星的数目是每一行减去空格的二倍
# 0*******0空格7  7-0
# 1 ***** 1空格5  7-2
# 2  ***  2空格3  7-4
# 3   *   3空格1  7-6
# 4  ***  2空格3  7-4
# 5 ***** 1空格5  7-2
# 6*******0空格7  7-0

# 两个特点
#1 行号和空格数相等
#2 *号个数=7-行号*2

'''第一次实现代码
i=0#行号,第几行
while i<4:
    print(" "*i,end="");#打印每行开头的空格，空格
    j=0;#为打印星号而设立变量
    while j<7-2*i:
        print("*",end="")#打印每行的型号
        j+=1;
    print("");#实现每一行换行输出
    i+=1;
i=i-1;
while i>0:
    i-=1;
    print(" "*i,end="")#打印开头空格
    j=0;
    while j<7-2*i:
        print("*",end="")
        j+=1;
    print("");
'''

#寻找相同代码进行合并
'''
print(" "*i,end="");#打印每行开头的空格，空格
    j=0;#为打印星号而设立变量
    while j<7-2*i:
        print("*",end="")#打印每行的型号
        j+=1;
    print("");#实现每一行换行输出
'''

#合并倒三角形和正三角形

m = 7;#定义行数，控制总的行数
i = 0;
h = 0; #每行打印的空格数
middle = m//2;#4中间位置
while i<m:
    if i<=middle:
        h=i;
        # pass #pass表示先占一个位置
    else:
        h-=1
        # pass
    n=m-2*h;
    #打印一行开头的空格和星号
    print(" " * h, end="");
    j=0;
    while j<n:
        print("*",end="")#打印每行的型号
        j+=1;
    print("");#实现每一行换行输出
    i+=1;


